app/controllers/albums_controller.rb

SELECT * FROM `albums` WHERE (`albums`.`user_id` = 2)
---
  def index
    @albums = Album.all(:conditions => {"user_id" => current_user.id})

SELECT * FROM `albums` WHERE (`albums`.`id` = 2)
---
  def edit
    @album = Album.find(params[:id])

SELECT * FROM `albums` WHERE (`albums`.`id` = 7)
---
  def show
    @album = Album.find(params[:id])

SELECT * FROM `albums` WHERE (`albums`.`id` = 2)
UPDATE `albums` SET `album_name` = 'this as sparta1', `scope` = 'private', `updated_at` = '2010-06-05 21:30:31' WHERE `id` = 2
UPDATE `users` SET `last_request_at` = '2010-06-05 21:30:31', `perishable_token` = '5-4chOXwMWWvFcHxOm4d', `updated_at` = '2010-06-05 21:30:31' WHERE `id` = 2
---
  def update
    @album = Album.find(params[:id])
    if @album.update_attributes(params[:album].merge(:user => current_user))

INSERT INTO `albums` (`album_name`, `scope`, `user_id`, `created_at`, `updated_at`) VALUES('this as sparta', NULL, 2, '2010-05-22 21:54:31', '2010-05-22 21:54:31')
---
  def create
    @album = Album.new(params[:album].merge(:user => current_user))
    if(@album.save)