app/controllers/photos_controller.rb

SELECT * FROM `albums` WHERE (`albums`.`id` = 1)
SELECT * FROM `photos` WHERE (`photos`.`album_id` = '1')
---
  def index
    @album = Album.find(params[:album_id])
    @photos = Photo.all(:conditions => {"album_id" => params[:album_id]})

SELECT * FROM `albums` WHERE (`albums`.`id` = 1)
---
  def new
    @album = Album.find(params[:album_id])

SELECT * FROM `albums` WHERE (`albums`.`id` = 1)
SELECT * FROM `photos` WHERE (`photos`.`id` = 1)
---
  def edit
    @album = Album.find(params[:album_id])
    @photo = Photo.find(params[:id])

SELECT * FROM `albums` WHERE (`albums`.`id` = 1)
SELECT * FROM `photos` WHERE (`photos`.`id` = 1)
---
  def show
    @album = Album.find(params[:album_id])
    @photo = Photo.find(params[:id])