app/controllers/users_controller.rb

INSERT INTO `users` (`login`, `first_name`, `last_name`, `email`, `crypted_password`, `password_salt`, `persistence_token`, `single_access_token`, `perishable_token`, `login_count`, `failed_login_count`, `last_request_at`, `current_login_at`, `last_login_at`, `current_login_ip`, `last_login_ip`, `created_at`, `updated_at`) VALUES('narshlob', NULL, NULL, 'yourmom@whatever.com', '60c89f1a27d1daee2abe79f2962468d0e264e1613e37a8a080fbcfae33d786db354847e403af70c1de43a7b5b5e7c06f77ed2eea3079cde03eee8306f0033368', 'rLz1-84nuf_bdAVW6Zb9', 'e6c578d7f5e3a564b3dfed60d7cfd34c085847e093fcae46fceaec8a7343c6dc0275b2b596a69c24d6c4a89a37f16eac5e231f7ce94819e9888812d443cf052e', '88W8ld6nr3332URSq79E', 'NS5TqXw5HVC5Zo9QbxXs', 1, 0, '2010-03-09 04:31:19', '2010-03-09 04:31:19', NULL, '127.0.0.1', NULL, '2010-03-09 04:31:19', '2010-03-09 04:31:19')
---
  def create
    @user = User.new(params[:user])
    if @user.save